CAMPAIGN = """

📢 کمپین بالا  همچنان برای کانال های زیر در دسترس است. 📢

"""

START = """
سلام %s
به سرویس درآمدزایی از طریق کانال تلگرام خوش آمدید.
 مرحله به مرحله با ربات درآمدزایی پیش بروید و پس از اتمام مراحل با دریافت سفارش تبلیغ از ربات درآمد خود را روز به روز افزایش دهید. 💵💰
"""

CANCEL = "ربات متوقف شد."

CANT_START = "اکانت شما غیرفعال⛔ شده است و نمی توانید فعالیت کنید لطفا برای اطلاعات بیشتر با ادمین در ارتباط باشد."

ABOUT_US = """
به سرویس «درآمدزایی از طریق کانال تلگرام» خوش آمدید؛ مرحله به مرحله با ربات درآمدزایی پیش بروید و پس از اتمام مراحل، با دریافت سفارش تبلیغ از ربات، درآمد خود را روز به روز افزایش می‌دهید.  💵💰
"""

HELP = """
شما مي توانيد با مراجعه به كانال راهنما ، اطلاعات مورد نياز براي كاربري ربات را دريافت كنيد...
👇🏻👇🏻👇🏻
@guide_channel
@guide_channel
@guide_channel

همچنين مي توانيد سوالات خود را به صورت مستقيم با ادمين @adbotadmin در ميان بگذاريد...
"""
WRONG_KEYBOARD = "لطفا از منوی زیر انتخاب کنید."

ERROR = """
فرایند با خطا مواجه شده است. لطفا در صورت بروز مجدد خطا با ادمین تماس بگیرید.
با تشکر ❤️.

@adbotadmin
@adbotadmin
@adbotadmin
"""

# remove channel messages

REMOVE_CHANNEL = "لطفا شناسه کانالی که می خواهید حذف کنید را ارسال کنید: \n @mychannel"

REMOVE_CHANNEL_ERROR = "شناسه وارد شده معتبر نیست لطفا مانند مثال ارسال کنید. \n\nمثال: @mychannel"

REMOVE_CHANNEL_SUCCESS = "کانال با موفقیت از لیست کانال های شما پاک شد."

REMOVE_CHANNEL_NOT_EXISTS = "کانال با شناسه وارد شده در لیست کانال های شما وجود ندارد."

REMOVE_CHANNEL_INFO = """
کانال با مشخصات وارد شده موجود است از لیست کانال های شما پاک شود ؟

شناسه🆔: {{ tag }}
عنوان: {{ title }}
تعداد اعضا👪: {{ members }}
"""

REMOVE_CHANNEL_CANCEL = "فرایند حذف کانال متوقف شد."

# add channel messages

ADD_CHANNEL = """
شناسه‌ی کانال تلگرام خود را وارد نمایید. به عنوان مثال: @tablighat
"""

ADD_CHANNEL_ALREADY_EXIST = "کانال با این شناسه هم اکنون در لیست کانال‌های شما موجود است."

ADD_CHANNEL_BLOCKED = """
این کانال هم اکنون مسدود است لطفا برای افزودن آن به لیست خود با ادمین تماس بگیرید.

@adbotadmin
@adbotadmin
@adbotadmin
"""

ADD_CHANNEL_NOT_FOUND = """
کانال با شناسه وارد شده یافت نشد لطفا بررسی و مجددا امتحان کنید.
"""

ADD_CHANNEL_NO_CATEGORY = "شما باید حداقل یک دسته بندی را انتخاب کنید."

ADD_CHANNEL_FAILED = """
شناسه‌ی وارد شده صحیح نمی باشد. لطفاً مجدداً تلاش نمایید.
"""

ADD_CHANNEL_INFO = """
آیدی🆔: {{ id }}
عنوان: {{ title }}
تعداد اعضا👪: {{ members }}
"""

ADD_CHANNEL_EXIST = """
کانال با شناسه وارد شده موجود است ثبت شود ؟

شناسه 🆔: {{ tag }}
عنوان 💬: {{ title }}
شماره‌شبا 💳: {{ sheba }}
"""

ADD_CHANNEL_ERROR = """
فرایند افزودن کانال جدید با مشکل مواجه شد لطفا مجددا اقدام کنید.
"""

ADD_CHANNEL_CATEGORY = """
موضوع یا موضوعات مربوط به کانال را انتخاب نمایید.
"""

ADD_CHANNEL_SUCCESS = """
کانال با موفقیت اضافه شد.
هر زمان مايل بوديد مي توانيد از بخش گزينه هاي ربات ، كانال جديدي را به ليست كانال هاي خود اضافه كنيد.
"""

# channel list
CHANNEL_INFO_LIST = """
عنوان💬: {{ title }}
شناسه کانال💬: {{  tag }}

شماره شبا💳: {{ sheba_no }}
دارنده حساب👤: {{ sheba_owner }}

🔸🔸🔸🔸🔸🔸🔸🔸🔸🔸🔸🔸
"""

NO_CHANNEL = 'کانالی برای شما ثبت نشده است.'

NO_SHEBA_GET_AD = """

⚠️کانال(هایی) که شماره شبا برای آنها وارد نشده.⚠️
لطفا با مراجعه به لیست کانال ها شماره شبا آنها را ثبت کنید.
"""

NO_SHEBA_CHANNEL_INFO = "کانال: %s شبا: ❌ \n"

# sticker
# SEND_STICKER = "استیکر مورد نظر خود برای استفاده در تبلیغات را ارسال نمایید."

SEND_STICKER = "در صورتی که میخواهید استیکر بالا تغییر کند استیکر مورد نظر خود را ارسال نمایید."

SEND_STICKER_SUCCESS = "استیکر باموفقیت دریافت شد."

SEND_STICKER_ERROR = "لطفا استیکر ارسال کنید."

# sheba number
SEND_SHEBA = """

شماره شبای خود را وارد نمایید.
به عنوان مثال:

IR270170000000100324200001
"""

SEND_SHEBA_SUCCESS = "شماره شبا باموفقیت دریافت شد. نام دارنده حساب را وارد کنید."

SEND_SHEBA_CONFIRM = """
آیا از اطلاعات وارد شده اطمینان دارید پس از اولین ثبت امکان تغییر مجدد شماره شبا فقط از طریق پیام به ادمین وجود دارد.
شماره: 🏧
 %s
صاحب حساب: 👤
 %s

"""

SEND_SHEBA_OWNER_SUCCESS = """
کانال و شماره شبا با موفقیت ذخیره شد.
"""

SEND_SHEBA_ERROR = "لطفا شماره شبای خود را صحیح وارد نمایید."

SEND_SHEBA_CANCEL = "دریافت شماره شبا توسط شما لغو شد."

SEND_SHEBA_ERROR_SAVE = "در ذخیره سازی شماره شبا مشکلی پیش آمد. لطفا مجددا تلاش کنید."

SEND_SHEBA_TEMPLATE = """
شماره شبا با مشخصات:
شماره: 🏧
 {{ sheba }}
صاحب حساب: 👤
 {{ sheba_owner }}
قبلا برای شما تعریف شده است.

برای تغییر آن با ادمین تماس بگیرید.
@adbotadmin
@adbotadmin
"""

# shot
SEND_SHOT = "کمپین مورد نظر خود را انتخاب نمایید."

SEND_SHOT_TIME_ERROR = "🚫📷هنوز دریافت شات برای این کمپین فعال نشده است.🚫📷"

SHOT_ERROR = "در خواندن اطلاعات کمپین شما مشکلی به وجود آمده لطفا مجددا تلاش کنید."

SEND_SHOT_SUCCESS = "اسکرین شات ارسالی شما دریافت شد."

SEND_SHOT_RENDER_ADVC_ERROR = "در دریافت شات برای کمپین شما مشکلی پیش آمد لطفا مجددا تلاش نمایید."

SEND_SHOT_RENDER_CPU_ERROR = "کمپین منتخب برای هیچکدام از کانال‌های شما دریافت نشده است. لطفا با ادمین تماس بگیرید."

SEND_SHOT_RENDER_ADVC_CHOICE = """
کانال(های) خود را جهت ارسال اسکرین شات برای کمپین:
 
*%s*

انتخاب کنید.
"""

SEND_SHOT_RENDER_BANNER_CHOICE = "بنری که می‌خواهید برای آن اسکرین شات ارسال کنید را انتخاب کنید."

SEND_SHOT_INPUT = "تصویر شات نهایی بنر کمپین خود را ارسال نمایید."

SEND_SHOT_ERROR = "در دریافت اسکرین شات مشکلی پیش آمد."

SEND_SHOT_NOT_ADV = "کمپین پایان یافته ای برای ارسال شات اتمام وجود ندارد"

SEND_SHOT_BAD_INPUT = "ورودی نا معتبر لطفا تصویر اسکرین شات ارسال کنید."

SEND_SHOT_CHOSE_BANNER = "لطفا ابتدا بنر خود را برای ارسال شات انتخاب کنید یا در صورت بروز مجدد خطا با ادمین تماس بگیرید."

# get adv
GET_ADV_ERROR = "در ایجاد و ارسال تبلیغ مشکلی پیش آمد لطفا در صورت تکرار با ادمین تماس بگیرید."

GET_ADV_GOT_BEFORE = "شما برای کانال(های) انتخابی قبلا این تبلیغ را گرفته اید."

GET_ADV_NO_CHANNEL_ERROR = "لطفا کانال مورد نظر را انتخاب کنید."

GET_ADV_LIMITED = "❌از آخرین تبلیغ دریافتی شما باید حداقل ۶۰ ثانیه گذشته باشد.❌"

GET_ADV_TIME = "گروه زمانی تبلیغ خود را انتخاب نمایید."

GET_ADV_CHOOSE = "تبلیغ مورد نظر خود را انتخاب نمایید."

GET_ADV_NOTHING = "در حال حاضر تبلیغ فعالی برای دریافت موجود نیست."

GET_ADV_VALID = "تبلیغ‌ (های) قابل دریافت برای شما:"

GET_ADV_NO_ACTIVE_CHANNEL = "کانال فعالی برای شما وجود ندارد."

GET_ADD_CHOOSE_CHANNELS = """لطفا کانال های خود را انتخاب یا با کلیک بروی گزینه 
همه کانال ها ⬇️
تبلیغ مورد نظر را برای تمام کانال های خود دریافت کنید.
"""

GET_ADV_INFO = """
تبلیغ با عنوان : {{ title }}
با شناسه: {{ code }}

برای کانال(های):

{{ channels }}

ارسال شد. ✅

"""

GET_ADV_DEACTIVE_CHANNELS = """

عنوان کانال 💬: {{ title }}
شناسه کانال 🆔: {{ tag }}
وضعیت: {{ status }}
"""


SHEBA_CLICKED = "کانال(های) مربوط به این شماره شبا بالای ان قرار گرفته اند."

SHEBA_NOT_SAME = "شما فقط می توانید کانال(هایی) با شماره شبای یکسان انتخاب کنید."


TARIFF_NOT_SAME = "شما فقط می توانید کانال(هایی) با تعرفه و شبا یکسان انتخاب کنید."


GET_ADV_CLOSED = "این کمپین دیگر فعال نیست و قابلیت دریافت ندارد.\nباتشکر🌺."


USER_CONDITION = """
🔴 بنر  ها با نقل قول فوروارد شود توجه کنید که ویو #قطع_نشود❌ ویو قطع بشه واریز ندارد ❌
"""

USER_CONDITION_1 = """
🔴 بنر با نقل قول فوروارد شود توجه کنید که ویو #قطع_نشود❌ ویو قطع بشه واریز ندارد ❌
"""
USER_CONDITION_2 = """
🔴 بنر و ریپ هر دو با نقل قول فوروارد شود توجه کنید که ویو #قطع_نشود❌ ویو قطع بشه واریز ندارد ❌
"""

USER_CONDITION_3 = """
🔴 بنر و استیکر هر دو با نقل قول فوروارد شود توجه کنید که ویو #قطع_نشود❌ ویو قطع بشه واریز ندارد ❌
"""

USER_CONDITION_MORE_THAN_ONE = """
 با توجه به اینکه تبلیغ #مشترک میزنید توجه کنید تبلیغ داخل همه کانال هاتون با ویو فوروارد شود
"""

# active adv
ACTIVE_ADVS = "کمپین(های) فعال شما به شرح زیر است با کلیک بروی هرکدام می توانید جزییات آنرا مشاهده کنید."

NO_ACTIVE_ADVS = "شما در حال حاضر کمپین فعالی ندارید."

ACTIVE_ADV_CONTROLS = "تبلیغ منتخب شما به ازای کانال های زیر دریافت شده است."

ACTIVE_AD = """
تبلیغ با عنوان 📍: {{ title }}
برای کانال های 📂:

{{ channels }}
 
اختصاص یافته است.
⚡⭐⚡⭐⚡⭐⚡
"""


# financial

FINANCIAL_INFO = "لیست گزارشات مالی شما به شرح زیر است."

FINANCIAL_NOTHING = "گزارش مالی برای شما موجود نیست"

FINANCIAL = """

💬 \u200f کمپین:  {{ title }}
📅 ‌\u200f{{ date }}
📂 ‌\u200f{{ channels }}

📈 ‌\u200f :آمار بازدید
 ‌\u200f{{ banners_info }}

{% if paid %}✅ \u200fپرداخت شده{% else %}❌ \u200fپرداخت نشده{% endif %}
{% if price %}
* اطلاعات پرداخت *
      💵 ‌\u200f{{ price }} ریال
      📆‌‌‌‌ ‌\u200f{{ price_date }}
      💹 ‌\u200f{{ price_code }}
{% endif %}
🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸🔹🔸

"""


# TODO: no sheba channels useless in future

SEND_NO_SHEBA_SUCCESS = "شبا با موفقت دریافت شد کانال هایی که میخاهید برای این شبا ثبت کنید را انتخاب کنید."


SEND_SHEBA_CHOSE = "شماره شبای خود را انتخاب کنید یا مانند مثال وارد کنید \n\nIR270170000000100324200001"


NO_SHEBA_CHANNEL = """
⚠️برای این کانال(ها) هنوز شماره شبا ثبت نشده است .⚠️
برای اینکه بتوانید برای این کانال ها تبلیغ دریافت کرده و
از امکانات دیگر استفاده کنید لطفا با کلیک بروی دکمه زیر شبای مربوط به آن(ها) وارد کنید.

%s
"""

# push messegas
GOT_BEFORE = """📢⛔
این تبلیغ قبلا توسط ادمین {} دریافت شده است. لطفا از انتخاب های موجود مجددا استفاده کنید.
⛔📢"""

# file id

FILE_ID = "لطفا فایل خود را آپلود یا forward کنید."

POST_LINK_CONTENT = """
لطفا پست با آدرس:
{}

را از کانال مبدا به کانال خود فورواد کنید.
"""