PAID_PUSH = """
سلام دوست عزیز 🌸
واریزی تبلیغ با عنوان:
" %s " 
برای کانال های:
`
%s
` 
تسویه شده. برای چک می توانید به قسمت گزارش واریز بات سربزنید
و در صورت وجود سوال یا مشکل با ادمین درارتباط باشید.

\u200f@adbotadmin
\u200f@adbotadmin
\u200f@adbotadmin

تشکر بابت حضورتون ❤️
"""

SEND_SHOT_PUSH = """
⛔️ تبلیغ «{}» به پایان رسید .

🔻لطفا شات بنرها رو بدین به ربات

❌دقت کنید شات #اشتباه ندین ، موقع ارسال شات به عنوان و تاریخ دکمه شات دقت کنید ❌

متن بالا نمونه است که مدل به صورت زیر است
⛔️ تبلیغ «{}» به پایان رسید . 
"""